[
  {
    "name": "Bell Beefer",
    "url": "https://tacobell.fandom.com/wiki/Bell_Beefer",
    "img": "Bellbeefer.jpg",
    "detail": "Bell Beefer\nThe Bell Beefer was a hamburger bun based meal on Taco Bell's menu from the mid 1970s (They were on the menu in the 60s) to the mid 1990s, with a short comeback in the early 2010s as an update to the Bellburger. Recently brought back as a short addition to the dollar menu in select restaurants in 2012, it had been very popular in the San Francisco metropolitan area. Disgruntled fans of the Beefer held restaurant sit-ins known as “Stank Festivals”, a commentary on Taco Bell's reputation, in protest after its cancellation. Originally created by executives John “Johnny” C. Hoba  and Douglas “Doug” O. Hoba to combat items offered at hamburger chains, the Bell Beefer was a bun with meat, diced onions, shredded lettuce and mild border sauce. A Bell Beefer Supreme was also offered, which added diced tomatoes and grated cheese. A few select restaurants offered the Bell Beefer Surf and Turf Deluxe, which added fried shrimp and a scoop of tuna on top of the Beefer's lettuce, as well as a line of Taco Tartar Sauce. More like a Sloppy Joe than a hamburger, it was well-liked early on, but declined in popularity during the late 1980s. It had a resurgence in popularity in the early 2010s, although that was only for a short while. John Cena recently has claimed that he is very upset they ever discontinued this item off of the Taco Bell menu."
  },
  {
    "name": "Grande Soft Taco",
    "url": "https://tacobell.fandom.com/wiki/Grande_Soft_Taco",
    "img": "Grandesofttaco.jpg",
    "detail": "One of the only known photographs of Grande Soft Taco\nGrande Soft Taco is a modified Soft Taco in which the portion of ground beef has been doubled and the entire unit is wrapped in another soft flour tortilla, with nacho cheese serving as a mortar between the two shells.\n\nGrande Soft Taco can be found on the Big Bell Value Menu.\n\nGrande Soft Taco contains 450 calories, including 21 grams of fat and 19 grams of protein."
  },
  {
    "name": "Spicy Chicken Burrito",
    "url": "https://tacobell.fandom.com/wiki/Spicy_Chicken_Burrito",
    "img": "Spicy-chicken.jpg",
    "detail": "The Spicy Chicken Burrito was a type of burrito found on the Big Bell Value Menu at participating Taco Bell locations. They consisted of a soft flour tortilla stuffed with spicy shredded chicken, rice, creamy jalapeño sauce, and Fiesta Salsa.\n\nThe Spicy Chicken Burrito was discontinued in 2011 and replaced with the Chicken Burrito, However it is available at some locations in Ontario, Canada.\n\nAccording to the official Taco Bell website, the Spicy Chicken Burrito contained 400 calories, 17 grams of fat, and 14 grams of protein."
  },
  {
    "name": "Spicy Chicken Soft Taco",
    "url": "https://tacobell.fandom.com/wiki/Spicy_Chicken_Soft_Taco",
    "img": "Spicy-chicken-Taco.jpg",
    "detail": "The Spicy Chicken Soft Taco is a variation on Taco Bell's traditional soft taco, which features spicy shredded chicken, lettuce, and Fiesta Salsa wrapped in a soft burrito. The chicken found in the Spicy Chicken Soft Taco is the same as that of the Spicy Chicken Burrito.\n\nAccording to various sources, the Spicy Chicken Soft Taco began on the now-defunct Big Bell Value Menu, and after the removal of the menu, the taco became a regular addition to the lineup.\n\nCalorieCount.com gives this taco a D+ rating. It has 160 calories, 5g of fat, and 480mg of sodium."
  },
  {
    "name": "Breakfast Crunchwrap",
    "url": "https://tacobell.fandom.com/wiki/Breakfast_Crunchwrap",
    "img": "Breakfast_Crunchwrap.jpg",
    "detail": "The Breakfast Crunchwrap is a breakfast item available at Taco Bell. \n\nIt was introduced on March 27, 2014 when the breakfast menu was introduced to TB nationwide, and has stayed on the menu ever since. It consists of eggs, cheese, creamy jalapeño sauce, a hash brown, and choice of bacon, sausage, or steak wrapped in a hexagonal tortilla fold. The breakfast crunchwrap may or may not be cursed."
  },
  {
    "name": "Breakfast Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Breakfast_Quesadilla",
    "img": "Breakfast_Quesadilla.jpeg",
    "detail": "The Breakfast Quesadilla is a breakfast item available at Taco Bell.\n\nIt was first introduced January 28, 2017. In 2020, it was taken off the menu temporarily as well as all the other breakfast items as many Taco Bells had to streamline operations due to the COVID-19 pandemic. The breakfast menu did return to Taco Bell in late 2021; however the Breakfast Quesadilla was not reintroduced until some point in 2022.\n\nBuenos Dias. It’s how you say “Good Morning” in Spanish.\n\nUnfortunately some mornings don’t start off so good, do they? We’ve all been there. Your alarm doesn’t go off, you misplaced your phone, you missed the bus, etc. Whatever the case, your morning is not going well and it looks like you won’t have time for breakfast (again). Not good amigo, but don’t worry because Taco Bell® has your back and can’t wait to fill that void in your life. Behold the deliciously new Breakfast Quesadilla. It’s filled with the warm, pillowy eggs and melty cheese you crave, all served up in that Mexican inspired way that only the Bell can do. It’s simply good, or as some might say… “Bueno”.\""
  },
  {
    "name": "Cap'n Crunch Delights",
    "url": "https://tacobell.fandom.com/wiki/Cap%27n_Crunch_Delights",
    "img": "Pdp-capt-crunch-delights.jpg",
    "detail": "NOTE: This page contains information on a recently-released product. Information may change as time passes.\n\nTaco Bell's Cap'n Crunch Delights are pastries available on Taco Bell's breakfast menu. The Delights are warm, light pastries, coated with fruity Crunch Berries cereal and filled with creamy, sweet milk icing. The product launched on July 2, 2015, and the Delights are .[1]\n\nCap'n Crunch Delights have been met with mixed reviews. GrubGrade gave the pastries a 7.00 out of 10[2], while the long-tenured food review site The Impulsive Buy gave the morning snack just a 2 out of 10.[3] Both websites called out the excessive frying/oily texture."
  },
  {
    "name": "Cinnabon Delights",
    "url": "https://tacobell.fandom.com/wiki/Cinnabon_Delights",
    "img": null,
    "detail": "Cinnabon Delights are a dessert and a breakfast item served at Taco Bell. They are round pieces of bread covered with sugar and have an icing center. They come in a 2-pack, a 4-pack and a 12-pack.  They were first introduced in 2013."
  },
  {
    "name": "Dressed Egg Taco",
    "url": "https://tacobell.fandom.com/wiki/Dressed_Egg_Taco",
    "img": "Dressed_Egg_Taco.jpg",
    "detail": "The Dressed Egg Taco was a breakfast menu item available at Taco Bell as an LTO from late 2017 to mid-2018. It consisted of a flour tortilla wrapped around an egg, with potatoes, shredded cheese, nacho cheese, and a choice of either bacon or sausage crumbles."
  },
  {
    "name": "Mountain Dew Kickstart Orange Citrus",
    "url": "https://tacobell.fandom.com/wiki/Mountain_Dew_Kickstart_Orange_Citrus",
    "img": null,
    "detail": "Mountain Dew Kickstart Orange Citrus is a drink served at Taco Bell.\n\n\"If you’re living life the way you’re supposed to, morning is always going to be a struggle.\n\nIt’s like the worst bully of all time, just picking on you when you’re most vulnerable, too tired to fight back. This is why Mountain Dew Kickstart exists, to give you the energy to fight through the fatigue and punch morning right in its little 8 A.M. smack-talking mouth.\""
  },
  {
    "name": "Naked Egg Taco",
    "url": "https://tacobell.fandom.com/wiki/Naked_Egg_Taco",
    "img": "Naked_Egg_Taco.jpeg",
    "detail": "The Naked Egg Taco is a breakfast item available at Taco Bell. It is also part of the Naked Egg Taco Combo.\n\n\"What is the shell? Seriously…what the shell is the shell? No, you’re not dreaming. It’s the new Naked Egg Taco, so you can only imagine what the shell the shell is?\n\nConfused by all the shell talk yet? Nah, you know what we’re talking about. The shell of a Naked Egg Taco is a fried egg, of course! And it’s our first taco made entirely of classic breakfast ingredients, both inside and out. It’s what you’ve always dreamed the perfect breakfast could be. Kind of like the breakfast you remember mom making you every morning. You know, with the smiley face bacon and all. Ok, we can’t guarantee there will be a smiley face made out of bacon inside your taco, but one bite is sure to put a smile on your face. It’s got your choice of bacon or sausage, seasoned potatoes, and warm melty cheddar cheese and nacho cheese sauce all folded up in a fried egg. You guessed it, in the shape of taco because, well, we ARE Taco Bell after all.\n\nLike we said, this taco is what you’ve always dreamed of. Let’s call it…the breakfast of your dreams! And this breakfast of your dreams is literally in your dreams. You’ll be dreaming about this Naked Egg Taco every night. You may even catch yourself day dreaming about it while you’re at work. We don’t blame you. We find ourselves dreaming about this dreamy breakfast taco too, which is why we created it. Now everyone can get a taste of this delicious breafasty dream. But that doesn’t mean you have to stop dreaming. We don’t want you to give up dreaming altogether, because where’s the fun in that? Just know that the Naked Egg Taco is real life now. So go ahead… Roll into your local Taco Bell and see for yourself. Your dream HAS come true with the Naked Egg Taco.\""
  },
  {
    "name": "Sausage Flatbread Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Sausage_Flatbread_Quesadilla",
    "img": "Taco-Bell-Sausage-Flatbread-Quesadilla.jpg",
    "detail": "The Sausage Flatbread Quesadilla is a breakfast menu item available at Taco Bell.\n\nIt contains sausage packed inside a flatbread with scrambled eggs and lots of warm, melted cheese.\n\nAlongside many other breakfast items, the Sausage Flatbread Quesadilla is $1."
  },
  {
    "name": "1/2-Pound Beef",
    "url": "https://tacobell.fandom.com/wiki/1/2-Pound_Beef",
    "img": null,
    "detail": "Burrito very good dude\nSo basically there are a lot of food items you can get from the taco bell\n\n1. baja \n2."
  },
  {
    "name": "1/2-Pound Beef & Potato Burrito",
    "url": "https://tacobell.fandom.com/wiki/1/2-Pound_Beef_%26_Potato_Burrito",
    "img": "Pdp_1_2_cheesy_potato.png",
    "detail": "The 1/2-Pound Beef & Potato Burrito is a burrito from Taco Bell. It contains a double-portion of beef, with potatoes, red sauce, green onions, and sour cream."
  },
  {
    "name": "1/2-Pound Beef Combo Burrito",
    "url": "https://tacobell.fandom.com/wiki/1/2-Pound_Beef_Combo_Burrito",
    "img": "Taco_bell.png",
    "detail": "The 1/2-Pound Beef Combo Burrito is a burrito found on the Big Bell Value Menu at Taco Bell. It features all of the ingredients as a Bean Burrito, along with twice the beef that is normally found in a soft taco. The burrito was released alongside two others on the \"1/2 Pounders\" menu in May 2009, and alongside the Cheesy Potato Burrito, is still served in many Taco Bell locations across the country."
  },
  {
    "name": "1/2-Pound Cheesy Bean & Rice Burrito",
    "url": "https://tacobell.fandom.com/wiki/1/2-Pound_Cheesy_Bean_%26_Rice_Burrito",
    "img": "250591_215639515134933_7271844_n.jpg",
    "detail": "The 1/2-Pound Cheesy Bean & Rice Burrito was a limited-run burrito menu item from Taco Bell that lasted from 2005 to 2006 and came back until 2012. It is now back again in 2015 but with different ingredients. The burrito was a three-cheese blend, nacho cheese sauce, fiesta salsa (pico de gallo), beans, rice, and zesty jalapeno sauce encased in a flour tortilla. The burrito replaced the 1/2 Pound Bean Burrito Especial.\n\nAlthough discontinued officially, one can still get this made from the legendary \"Secret menu\" by requesting a bean burrito, hold the red sauce, hold the onions, add nacho cheese sauce, add three-cheese blend, add fiesta salsa (aka pico de gallo), add rice, add zesty jalapeno sauce."
  },
  {
    "name": "7 Layer Burrito",
    "url": "https://tacobell.fandom.com/wiki/7_Layer_Burrito",
    "img": null,
    "detail": "\n\nThe 7 Layer Burrito is on a 10.5 inch tortilla. It includes beans, mexican rice, sour cream, guacamole, 3 cheese, lettuce and tomatoes.\n\nThis is one of the items considered to be a \"Vegetarian Burrito\". Along with the 1/2 Pound Cheesy Bean and Rice Burrito.\n\nWrite the second section of your article here."
  },
  {
    "name": "7-Layer Burrito",
    "url": "https://tacobell.fandom.com/wiki/7-Layer_Burrito",
    "img": "Pdp_7_layer_burrito.jpg",
    "detail": "7-Layer Burrito\nThe 7-Layer Burrito was a large, meatless burrito filled with tomatoes, re-fried beans, seasoned rice, three-cheese blend, low-fat sour cream, guacamole, salsa, and lettuce in a flour tortilla. The burrito was introduced to Taco Bell customers in the United States in 1993 for vegan customers.  It was inspired by the \"seven-layer dip\" that had become a popular Tex-Mex staple in the 1980s. The original introductory price was 99 cents ($0.99) at most locations. However Taco Bell UK still has this on their menu, along with Taco Bell India.\n\n7-Layer Burrito in UK\nTaco Bell discontinued this recipe on September 11, 2020, in an effort to streamline the menu to make ordering faster and easier during the COVID-19 pandemic that had emerged by that time.\n\nThe recipe can, however, be manually recreated by customizing an existing menu item, the \"Cheesy Bean and Rice Burrito\".  The following steps can be applied to order a burrito with the same ingredients as the original seven-layer burrito:"
  },
  {
    "name": "Bean Burrito",
    "url": "https://tacobell.fandom.com/wiki/Bean_Burrito",
    "img": "Bean_Burrito_-_TB.jpg",
    "detail": "The Bean Burrito is a simple, meatless burrito. The 10\" flour tortilla is filled with a green scoop of beans, a pinch of onions, a pinch of cheddar cheese, and a pump of Red Sauce. It is one of Taco Bell's most famous menu items, especially given its simplicity and low cost which is $1.29. \n\nI don't know how long the Bean Burrito has been around, but it is a known favorite and it's already 2020. "
  },
  {
    "name": "Bean Burrito Especial",
    "url": "https://tacobell.fandom.com/wiki/Bean_Burrito_Especial",
    "img": "050223.jpg",
    "detail": "Perhaps the only surviving photo of a Bean Burrito Especial. Dated March 23, 2005.\nThe Bean Burrito Especial was a legitimate and extremely delicious burrito on the Big Bell Value Menu at Taco Bell. The bean burrito especial was a bean burrito with creamy jalapeno sauce added. Beans, red sauce, onion, cheedar cheese, and creamy jalapeno sauce. Sadly, the burrito could not survive in a Post-9/11 economy, and has been discontinued. \n\nThe origins of the Bean Burrito Especial can be traced to September 28, 2004, with a forum post titled \"Taco Bell's 99 cent Bean Burrito Especial\".[1]"
  },
  {
    "name": "Beefy Crunch Burrito",
    "url": "https://tacobell.fandom.com/wiki/Beefy_Crunch_Burrito",
    "img": "12193431_10153255919368358_6494535916838980121_n.jpg",
    "detail": "Beefy Crunch Burrito (Pure Deliciousness)\nThe Beefy Crunch Burrito is a limited-run burrito from Taco Bell. It includes seasoned beef, Flamin' Hot Fritos, reduced-fat sour cream, Mexican rice, and nacho cheese sauce.\n\nIt was removed from the Taco Bell menu in 2016, and is currently slated to return in August of 2023.\n\nReleased in 2010 to critical acclaim, it initially rose to the top of Taco Bell sales. It would remain near the top of charts for over a year and a half. As Taco Bell saw decreasing demand, they made the decision in May 2011 to remove it from their menu, according to their Facebook page.\n\nAfter pressure from several revival movements, Taco Bell returned the burrito to its menu in late 2011, only to see it removed again in early 2012.\n\nFrom here, the Beefy Crunch Burrito began to see a \"McRib effect\", being released and discontinued with no real pattern. On May 23, 2013, the Burrito saw a return, only to be removed later that year.\n\nFor almost three years, the burrito remained in seclusion, until it was announced in March 2016 for another limited-time promotion. This time, it was to be a 6-week run, and as the time was coming for it's removal, Taco Bell posted a picture to their Instagram page. If it received 50,000 likes, the Beefy Crunch would stay another 6 weeks. With ease, the picture surpassed this milestone, and as of June 8th, 2016, the burrito was still available.\n\nA similar burrito, the Beefy Fritos Burrito, had appeared on the Dollar Cravings menu in its place. Fans of the Beefy Crunch Burrito rejected this burrito, citing that it is only similar in appearance, and not flavors. The Beefy Fritos Burrito was discontinued in 2020.[1] \n\nBeefy Crunch Movement logo.\nThe success of the Beefy Crunch Burrito is largely thanks to the Beefy Crunch movement, a fan-run Facebook page with nearly 70,000 followers. Since May 2011, they've lobbied for the return of the burrito, with plenty of successes, especially in 2016. Nothing about 2017 and Beyond.\n\nMost recently, followers of the movement even took a trip to Taco Bell HQ, as seen on their Facebook page."
  },
  {
    "name": "Beefy Fritos Burrito",
    "url": "https://tacobell.fandom.com/wiki/Beefy_Fritos_Burrito",
    "img": "Beefy_Fritos_Burrito.jpg",
    "detail": "The Beefy Fritos Burrito\nThe Beefy Fritos Burrito (not to be confused with the original Chili Cheese-based Frito Burrito) is a discontinued Dollar Menu item. Removed from the menu in August 2020, it was the last remaining item containing Frito-brand corn chips. It's removal occurring at the same time as Potato Bites, it is speculated to have been due to ingredient consolidation and menu simplification. Similar following items would use generic Crunchy Red Strips as a replacement ingredient. The burrito contained Frito Corn Chips, Seasoned Beef, Nacho Cheese and Seasoned Rice[1]."
  },
  {
    "name": "Beefy Melt Burrito",
    "url": "https://tacobell.fandom.com/wiki/Beefy_Melt_Burrito",
    "img": "Beefy_melt.jpg",
    "detail": "The Beefy Melt Burrito is a two dollar burrito at Taco Bell. It contains seasoned rice, seasoned beef, nacho cheese sauce, fiesta strips, a three-cheese blend, and sour cream, all wrapped in a tortilla,"
  },
  {
    "name": "Beefy Potato-Rito",
    "url": "https://tacobell.fandom.com/wiki/Beefy_Potato-Rito",
    "img": "Beefy_Potato-Rito.jpg",
    "detail": "Beefy Potato-Rito is a limited edition menu item available at Taco Bell during the late summer of 2017. It is one of the items in the Beefy Potato-Rito Box. This shit was literally a dollar AND the best burrito they have. Taco Bell is so wrong for taking this away bring this back permanently.\n\nThe Beefy Potato-Rito returned in April of 2021.\n\n\"Seriously. Think about it. Seasoned Beef and Potatoes are like the dynamic duo of the culinary universe. But hold on a sec! How come Potato is NEVER in the spotlight? It’s like Seasoned Beef is ALWAYS stealing the scene. Take Taco Bell’s new Beefy Potato-rito for example. This new $1* blockbuster is filled with those seasoned, crispy potato bites we all love. And let us not forget the great supporting roles of the melted, real cheddar cheese, creamy chipotle sauce and nacho cheese sauce. It’s obvious that it’s the combined powers of all these ingredients that makes this burrito truly amazing, not just the Seasoned Beef. Which is fine. Maybe one day Potato WILL star in his very own spin-off (without Seasoned Beef), but until then we can all look forward to their combined never ending battle to keep our budgets safe and cravings at bay.\""
  },
  {
    "name": "Big Beef Burrito",
    "url": "https://tacobell.fandom.com/wiki/Big_Beef_Burrito",
    "img": null,
    "detail": "\nThe big beef burrito was a burrito with 2 scoops of meat,cheese and red sauce. When i worked there some people put onions in it some didn't.\n\nAccording to Taco Bell video, it had double beef, beans, lettuce, cheese, onions, and red sauce."
  },
  {
    "name": "Burrito",
    "url": "https://tacobell.fandom.com/wiki/Burrito",
    "img": "Pdp_burrito_supreme.jpg",
    "detail": "Burritos are the second-most prominent menu item at Taco Bell, following the taco. Burritos generally consist of a soft flour tortilla shell stuffed with any combination of beans, ground beef, shredded cheese, lettuce, and tomatoes.\n\nThe word burrito is Spanish for \"tiny donkey.\"\n\nTaco Bell began selling burritos when Glen Bell took the chain public in 1970. They began varying the burrito kinds and adding more to their menu into the 1980s and the 1990s (such as the Bacon Cheeseburger Burrito, among others).\n\nThe 2000s and 2010s have seen the biggest variety of burrito styles, including the Grilled Stuft Burrito series, the Fresca menu burritos, and more.\n\nThe Burrito Supreme has been Taco Bell's signature burrito item since its introduction decades ago, while other limited-run burritos have also generated a large following. As of 2015, the Beefy Crunch Movement is working to bring the Beefy Crunch Burrito back to Taco Bell.\n\nVariations on the burrito include:"
  },
  {
    "name": "Burrito Supreme",
    "url": "https://tacobell.fandom.com/wiki/Burrito_Supreme",
    "img": "Main-qimg-af9161cbeeb1937b8723379e6e240499.png",
    "detail": "The Burrito Supreme, sometimes referred to as a Supreme Burrito, is a standard Taco Bell burrito, filled with meat, beans, Red Sauce, lettuce, cheddar cheese, sour cream, onions and tomatoes. It is the most commonly-ordered burrito from the restaurant.\n\nOriginally, it also featured black olive slices. These, however, were removed as a cost reduction.  Black olive slices were removed from all Taco Bell products that featured them, including the Enchirito. \n\nTaco Bell used to advertise the Big Beef (or Chicken or Steak) Burrito Supreme, which is the same as the above burrito but with double the meat. Today, it is just considered a Burrito Supreme with extra meat, also sometimes called a Double Burrito Supreme."
  },
  {
    "name": "Cheesy Bean and Rice Burrito",
    "url": "https://tacobell.fandom.com/wiki/Cheesy_Bean_and_Rice_Burrito",
    "img": "Pdp_cheesy-bean-and-rice-burrito.jpg",
    "detail": "The Cheesy Bean and Rice Burrito is a menu item available at Taco Bell locations. It contains hearty beans, premium Latin rice, warm nacho cheese, and creamy jalapeno sauce wrapped up in a flour tortilla.[1] It sells on the value menu for only $1 which means it is a very cheap and delicious option. This is also a item that has no meat in it so it is vegetarian but not vegan. Taco Bell is yet to add a vegan option so for but at least you can customize majority of the taco bell items to your preference."
  },
  {
    "name": "Cheesy Double Beef Burrito",
    "url": "https://tacobell.fandom.com/wiki/Cheesy_Double_Beef_Burrito",
    "img": "Pdp_cheesy_double_beef_burrito.jpg",
    "detail": "The Cheesy Double Beef Burrito was a burrito sold at Taco Bell. It was filled with a double portion of beef, nacho cheese sauce, and seasoned rice. It ran from late 2008 until 2010. It had since been discontinued until Taco Bell announced it would make its comeback on April 21, 2016, which was $1 (according to a Taco Bell Facebook post).\n\nIt came back again in 2022, with the price risen to $2, and Fiesta Strips added to the burrito. It also came with a spicy version with added jalapeños.\n\nThis burrito was originally featured in the 79, 89, 99 cent menu. It started at 89 cents but rose once 2009 hit. It then rose to 99 cents. in 2012, it was 1.89, in 2016 it was $1. In 2022, it was $2. In January 2024 it was priced $2.79."
  },
  {
    "name": "Chicken Burrito",
    "url": "https://tacobell.fandom.com/wiki/Chicken_Burrito",
    "img": "Chicken-Enchilada-Grilled-Stuft-Burrito-Taco-Bell.jpg",
    "detail": "\n\nThe Chicken Burrito is an item Sold at Taco Bell.  It had rice, chicken, avocado ranch sauce and 3 cheese blend.  This burrito did not come grilled."
  },
  {
    "name": "Chicken Caesar Grilled Stuft Burrito",
    "url": "https://tacobell.fandom.com/wiki/Chicken_Caesar_Grilled_Stuft_Burrito",
    "img": "17066_307356067535_7858147_n.jpg",
    "detail": "The Chicken Caesar Grilled Stuft Burrito was a burrito containing chicken, crunchy red strips, romaine lettuce, and Caesar dressing. It was available in the United States during summer 2003, and made a limited-edition return to Canada in 2008.\n\nThe former menu item has a large cult following through several revival campaign pages on Facebook, and it tops practically every \"bring back an item\" list."
  },
  {
    "name": "Chicken Enchilada Grilled Stuft Burrito",
    "url": "https://tacobell.fandom.com/wiki/Chicken_Enchilada_Grilled_Stuft_Burrito",
    "img": "Tacobell_chicken_enchilada_grilled_stuft_burrito.jpg",
    "detail": "The Chicken Enchilada Grilled Stuft Burrito was a menu item from Taco Bell. It contained grilled chicken, enchilada sauce, rice, sour cream, and a cheese blend. It was available from 2004-2007, and then brought back briefly in late 2010."
  },
  {
    "name": "Chili Cheese Burrito",
    "url": "https://tacobell.fandom.com/wiki/Chili_Cheese_Burrito",
    "img": "1076643_pdp_chili_cheese_burrito.png",
    "detail": "The Chili Cheese Burrito (initially introduced as the Chilito) is a normal sized burrito filled with cheddar cheese and a special hot chili sauce containing beef. The sauce is not topical; the beef is mixed with the sauce beforehand, making it impossible to order a Chicken or Steak Chilito. This burrito is steamed before serving.\n\nThe \"Chilito\" was introduced in 1990 as a part of the ¢59/79/99 budget menu. It was one of two offerings in the ¢79 category—the other being the MexiMelt. By the mid 90s, the Chilito had been removed from the National menu. \n\nThe Chili Cheese Burrito was not fully discontinued, however. Rather than removing it completely, it was instead left to franchisees to decide whether to continue carrying it, a decision that is usually decided by its relative regional popularity.  \n\nToday, the Chili Cheese Burrito is widely available throughout the Midwest of the United States, but has very limited availability West of the Rockies and East of the Appalachians. A community-sourced, complete map of all locations where Chili Cheese Burritos are available can be found here."
  },
  {
    "name": "Chipotle Grilled Stuft Burrito",
    "url": "https://tacobell.fandom.com/wiki/Chipotle_Grilled_Stuft_Burrito",
    "img": "ChipotleGrilledStuftBurrito.jpg",
    "detail": "Taco Bell's Chipotle Grilled Stuft Burrito was a limited-run burrito from Taco Bell's \"Stuft\" menu."
  },
  {
    "name": "Cutetitos",
    "url": "https://tacobell.fandom.com/wiki/Cutetitos",
    "img": null,
    "detail": "Cutetitos are a plush toy line made by Basic Fun Toys. They Were Released October 2018.\n\nStarting with Season 1-3, there were Basic Animals.\n\nDuring 2019, a spin-off series called Cutetitos Babitos was launched.\n\nLater on in Season 4 in 2020 , Cutetitos made another spin-off line Called Fruititos and a second season of Cutetitos Babitos is released.\n\nDuring Season 5, Another Spin-off Line was made. This time it was called “Pizzaitos” and series 3 of Babitos is released. There was also two spin-off released at the time called Taste Budditos and Unicornitos.\n\nIn 2021, Partyitos, Wave 2 Pizzaitos, series 2 Taste Budditos, Donutitos, Rainbowitos, series 2 Unicornitos, Carnivalitos, Care Bearitos and Cutetitos Dreamitos are introduced.\n\nIn 2022, Cutetitos Bearitos, Cutetitos Ponyitos, Carnivalitos series 2, and Cutetitos Islanditos are introduced."
  },
  {
    "name": "Dare Devil Menu",
    "url": "https://tacobell.fandom.com/wiki/Dare_Devil_Menu",
    "img": "Grillers.png",
    "detail": "Taco Bell's Dare Devil Menu was a menu of three different loaded grillers from 2015 to an unknown date (2016? or Late 2015?).\n\nEach griller cost only $1, making them a cheap food item.\n\nThere were 3 types of loaded grillers in the Dare Devil Menu:"
  },
  {
    "name": "Fajita Grilled Stuft Burrito",
    "url": "https://tacobell.fandom.com/wiki/Fajita_Grilled_Stuft_Burrito",
    "img": "Pdp_grill_stuft_chicken.jpg",
    "detail": "The Fajita Grilled Stuft Burrito was a limited run Grilled Stuft Burrito variant. This burrito was filled with meat, grilled onions, red and green bell peppers, sour cream, seasoned rice and a \"Zesty Fajita Sauce.\"\n\nIt launched with the Chicken Caesar Grilled Stuft Burrito back in the mid-2000s and was later discontinued."
  },
  {
    "name": "Frito Burrito",
    "url": "https://tacobell.fandom.com/wiki/Frito_Burrito",
    "img": "Chili_Fritos_Burrito.webp",
    "detail": "The original Fritos Burrito\nThe Frito Burrito (not to be confused with the Beefy Fritos Burrito) was a limited-run variation of the Chili Cheese Burrito. Fitting the name, Frito-brand corn chips along with Onions were added to the base ingredients of the Chili Cheese Burrito in emulation of a Frito Pie. As the item predates wider internet adoption little information is accessible, but vague sources such as a Facebook Fan-Page[1] and personal testimonies date the item back to the mid 1990's."
  },
  {
    "name": "Green Burrito",
    "url": "https://tacobell.fandom.com/wiki/Green_Burrito",
    "img": "1397248329000-photo-3-9-.JPG",
    "detail": "A Green Burrito, on top of a Taco Bell wrapper listed as \"Special\".\nThe Green Burrito is an item available from Taco Bell. It is a bean burrito with onions, cheese, and Verde sauce.\n\nThe green burrito is called a \"secret item\" because it is not on the menu, and must be asked for at the counter.  \n\nthe green sauce is the Green Tomatillo sauce,  not   the  verde sause in the packets \n\nThe green burrito is the best Taco Bell item ever.  Bring it back you FUCKS!!!"
  },
  {
    "name": "Grilled Stuft Burrito",
    "url": "https://tacobell.fandom.com/wiki/Grilled_Stuft_Burrito",
    "img": "Picture_1.png",
    "detail": "Grilled Stuft Burrito was a style of burrito served at Taco Bell, in which the burrito has been cooked using a Grill Press. The original Grilled Stuft Burrito features a flour tortilla filled with ground beef, beans, rice, a three-cheese blend featuring cheddar, pepperjack and mozzarella, creamy Pepper Jack Sauce, and Fiesta Salsa, although it can be upgraded to included grilled chicken or steak in place of the ground beef. According to Bill Pearce, Chief Marketing Officer of Taco Bell Corp., \"Grilled Stuft Burritos are some of the most popular and portable menu items Taco Bell has to offer.\"\n\nAll locations have discontinued the Grilled Stuft Burrito while being replaced by newer items. Some customers have voiced their outrage [1] over the decision.\n\nA great variety of Grilled Stuft Burritos have come and gone over the years, including:"
  },
  {
    "name": "Kalua Pork Grilled Stuft Burrito",
    "url": "https://tacobell.fandom.com/wiki/Kalua_Pork_Grilled_Stuft_Burrito",
    "img": "Tacobell_kp_bur_macprice.jpg",
    "detail": "The Kalua Pork Grilled Stuft Burrito is a discontinued menu item only available at Taco Bell locations in Hawaii. It launched in 2008, then was discontinued and subsequently re-released in June 2015. The item would be permanently retired in July of 2020 amidst the Covid-19 Pandemic, and has yet to return to the menu\n\nThe burrito contains rice, diced tomatoes, cheese, Kalua pork, sauce, and sour cream."
  },
  {
    "name": "Loaded Taco Burrito",
    "url": "https://tacobell.fandom.com/wiki/Loaded_Taco_Burrito",
    "img": "Taco-Bell-Loaded-Taco-Burrito.jpg",
    "detail": "The Loaded Taco Burrito is Taco Bell's latest promotional item (as of April 2017).\n\nAs the name suggests, the burrito is a mash-up of a taco and burrito. It consists of a double portion of seasoned beef plus lettuce, tomatoes, shredded cheese, crispy red tortilla strips, sour cream, and avocado ranch, wrapped up in a warm flour tortilla.\n\nAs of April 10, 2017, the item is not available on the Taco Bell website menu, although the window display can be seen at most Taco Bell locations within the United States.\n\nThe menu item has 550 calories, 29 grams of fat, 9 grams of saturated fat, 0.5 grams of trans fat, 50 milligrams of cholesterol, 1130 milligrams of sodium, 52 grams of carbohydrates, 7 grams of fiber, 4 grams of sugar, and 20 grams of protein.[1]"
  },
  {
    "name": "Nacho Crunch Grilled Stuft Burrito",
    "url": "https://tacobell.fandom.com/wiki/Nacho_Crunch_Grilled_Stuft_Burrito",
    "img": "Nacho_crunch_burrito.jpg",
    "detail": "Taco Bell's Nacho Crunch Grilled Stuft Burrito was a limited-run burrito from Taco Bell's \"Stuft\" menu. The burrito was introduced in 2005 and discontinued in 2006. The burrito contained a double-portion of beef, nacho cheese, low-fat sour cream, ripe diced tomatoes, and crunchy red strips."
  },
  {
    "name": "Quesarito",
    "url": "https://tacobell.fandom.com/wiki/Quesarito",
    "img": "Taco7f_2_web.jpg",
    "detail": "The quesarito is a menu item available at Taco Bell. It has the key components of a quesadilla and burrito rolled into one, and has seasoned beef all up in them cheeks really deep and good, premium Latin rice, Chipotle sauce, reduced-fat sour cream, and then wrapped up in a grilled quesadilla loaded with melted cheeses and nacho cheese sauce.\n\nThe name 'quesarito' is a clever example of a lingusitic blending known as portmanteau as it combines \"quesadilla\" and \"burrito.\" It is because of this that in Spanish-speaking countries the quesarito is commonly known as the \"what burrito.\"\n\nThe idea of the quesarito is not an original of Taco Bell, as Chipotle restaurants designed it from their secret menu. This idea dates back to 2011. However, Taco Bell is credited with innovating their own style of the quesarito, and making the food go mainstream and national in 2014.\n\nIn August of 2020, Taco Bell pulled it from their in-store and drive-through menus, instead only being available for order through the website or mobile app.\n\nOn April 19, 2023, the burrito was removed from the menu entirely. \n\nSince the mainstream launch of the quesarito, Taco Bell has introduced several variants of the quesarito. These include:\n\nWelcome to the Taco Bell Wiki's sandbox!\nThis page exists so that you can practice editing or formatting (see Editing help) without changing any serious content.  Feel free to try wiki editing out here first.\nThere is a tutorial on the Central (coordinating) Wikia that will step you through more of the things you can do.  Wiki allow for rather complicated formatting.  It can look overwhelming when you begin, but don't let it worry you.  Just start with the basics... enter some text, and learn the other pieces as you go.  Your content contributions are welcome and important.  The wiki is a collaborative effort and others can help with formatting and other improvements.\nBest wishes!\n\nAs an alternative, customers may also swap the ground beef for steak, chicken, or beans."
  },
  {
    "name": "Sausage & Bacon Grilled Stuft Burrito",
    "url": "https://tacobell.fandom.com/wiki/Sausage_%26_Bacon_Grilled_Stuft_Burrito",
    "img": null,
    "detail": "Write the text of your article here!"
  },
  {
    "name": "Spicy Chicken Burrito",
    "url": "https://tacobell.fandom.com/wiki/Spicy_Chicken_Burrito",
    "img": "Spicy-chicken.jpg",
    "detail": "The Spicy Chicken Burrito was a type of burrito found on the Big Bell Value Menu at participating Taco Bell locations. They consisted of a soft flour tortilla stuffed with spicy shredded chicken, rice, creamy jalapeño sauce, and Fiesta Salsa.\n\nThe Spicy Chicken Burrito was discontinued in 2011 and replaced with the Chicken Burrito, However it is available at some locations in Ontario, Canada.\n\nAccording to the official Taco Bell website, the Spicy Chicken Burrito contained 400 calories, 17 grams of fat, and 14 grams of protein."
  },
  {
    "name": "Sriracha Burrito",
    "url": "https://tacobell.fandom.com/wiki/Sriracha_Burrito",
    "img": null,
    "detail": "Sriracha Burrito was a menu item at Taco Bell."
  },
  {
    "name": "Steak Burrito",
    "url": "https://tacobell.fandom.com/wiki/Steak_Burrito",
    "img": null,
    "detail": "The Steak Burrito is an item at Taco Bell it has steak and Lava Sauce"
  },
  {
    "name": "Steak Burrito Bellgrande",
    "url": "https://tacobell.fandom.com/wiki/Steak_Burrito_Bellgrande",
    "img": null,
    "detail": "The Steak Burrito Bellgrande is a limited run burrito that was advertised in the 1990s. It was filled with steak, Green Sauce, cheddar cheese, Fiesta Salsa, sour cream and special potatoes, similar to the breakfast menu \"hash rounds\" you find at other fast food restaurants."
  },
  {
    "name": "Volcano Double Beef Burrito",
    "url": "https://tacobell.fandom.com/wiki/Volcano_Double_Beef_Burrito",
    "img": "Volcano_double_beef_burrito.jpg",
    "detail": "The Volcano Double Beef Burrito is a burrito from Taco Bell that is currently available in the United Kingdom, named purely just \"Volcano Burrito\" in the UK.\n\nNow out of production in the USA, it ran in 1995 to promote the movie \"Congo\" and again from May 2009 until August 2013 in the USA. It is packed with meat, rice, crunchy red strips, and Lava sauce.\n\nVolcano Burrito from the UK\nIt was featured on Taco Bell's Volcano Menu while it was in production in the USA."
  },
  {
    "name": "Volcano Quesarito",
    "url": "https://tacobell.fandom.com/wiki/Volcano_Quesarito",
    "img": "Maxresdefault.jpg",
    "detail": "The Volcano Quesarito is a recent menu item, released alongside Lava Sauce on September 24, 2015. It is much like a standard Quesarito, with the addition of Lava sauce.\n\nThe Volcano Quesarito is available either standalone or as a Big Box meal, which includes a Volcano Quesarito, alongside a Doritos Locos Taco, a standard Crunchy Taco, and a large soft drink for $5.99 (where available)."
  },
  {
    "name": "Wild Burrito",
    "url": "https://tacobell.fandom.com/wiki/Wild_Burrito",
    "img": null,
    "detail": "The Wild Burrito is a menu item available at Taco Bell."
  },
  {
    "name": "Zesty Fiesta Burrito",
    "url": "https://tacobell.fandom.com/wiki/Zesty_Fiesta_Burrito",
    "img": "Zesty_Fiesta_Burrito.jpg",
    "detail": "The Zesty Fiesta Burrito was a burrito available at Taco Bell from 2001-2004. It consisted of a flour tortilla filled with meat, Fiesta Salsa, seasoned rice, and cheddar cheese."
  },
  {
    "name": "Bacon Club Chalupa",
    "url": "https://tacobell.fandom.com/wiki/Bacon_Club_Chalupa",
    "img": "Bacon_Club_Chalupa.jpg",
    "detail": "The Bacon Club Chalupa was a menu item at Taco Bell. It was a standard chalupa shell filled with grilled chicken, bacon, ranch dressing, lettuce, shredded cheese, and diced tomatoes.\n\nThe item was reintroduced to the menu on July 2015, but was discontinued just a month after in August. It once more returned on December 24th, 2020, but was again discontinued on March 10, 2021. As of  March 9th, 2023, it is available to order again for a limited time."
  },
  {
    "name": "Club Chalupa",
    "url": "https://tacobell.fandom.com/wiki/Club_Chalupa",
    "img": "ClubChalupa.jpg",
    "detail": "The Club Chalupa was a menu item at Taco Bell."
  },
  {
    "name": "Double Chalupa",
    "url": "https://tacobell.fandom.com/wiki/Double_Chalupa",
    "img": "Double_Chalupa.png",
    "detail": "The Double Chalupa was a menu item at Taco Bell.\n\n\"Ahoy there! What the heck does Chalupa mean anyway?\n\nFirst off… Yes, it’s a real word. It’s Spanish, whose origins come directly out of Ol’ Mexico and is generally defined as a fried tortilla shell, in the shape of a brownish, beigeish, beigeish-brownish small boat, filled with lots of flavorful ingredients. Now imagine a much larger vessel, fully loaded with a double portion* of Taco Bell’s savory seasoned beef piled high with lettuce, tomatoes, shredded cheddar cheese, Nacho Cheese Sauce and reduced-fat sour cream. Sounds like quite the bounty right? Some might call it a boatload of goodness or even a yacht of yumminess. We call it the all new Double Chalupa, and it’s only available for a limited time. So set a course for your local Taco Bell now… or you might just miss the boat.\""
  },
  {
    "name": "Naked Chicken Chalupa",
    "url": "https://tacobell.fandom.com/wiki/Naked_Chicken_Chalupa",
    "img": "Naked_Chicken_Chalupa.jpg",
    "detail": "The Naked Chicken Chalupa was a menu item at Taco Bell."
  },
  {
    "name": "Santa Fe Chalupa",
    "url": "https://tacobell.fandom.com/wiki/Santa_Fe_Chalupa",
    "img": "Santa_Fe_Chalupas.jpg",
    "detail": "The Santa Fe Chalupa was a menu item at Taco Bell."
  },
  {
    "name": "Toasted Cheddar Chalupa",
    "url": "https://tacobell.fandom.com/wiki/Toasted_Cheddar_Chalupa",
    "img": "Toasted_Cheddar_Chalupa.jpg",
    "detail": "The Toasted Cheddar Chalupa was a limited-time menu item at Taco Bell. It was first introduced on September 12, 2019 and shortly after discontinued on October 17, 2019. It was then brought back on November 5, 2020 until it was once more discontinued on December 24, 2020 bring this back right now"
  },
  {
    "name": "Ultimate Chalupa",
    "url": "https://tacobell.fandom.com/wiki/Ultimate_Chalupa",
    "img": "Ultimate_Chalupa.jpg",
    "detail": "The Ultimate Chalupa was a menu item at Taco Bell."
  },
  {
    "name": "Wild Naked Chicken Chalupa",
    "url": "https://tacobell.fandom.com/wiki/Wild_Naked_Chicken_Chalupa",
    "img": "Wild_Naked_Chicken_Chalupa.jpeg",
    "detail": "The Wild Naked Chicken Chalupa was a menu item at Taco Bell.\n\n\"The original Naked Chicken Chalupa is spicy in its own right with an all-white meat, raised without antibiotics crispy chicken shell, kicked up with bold Mexican spices and seasoning and packed with shredded lettuce, tomatoes, cheddar cheese and creamy avocado ranch sauce,\" the chain said in a press release. \"But the new Wilder Naked Chicken Chalupa takes the heat to the next level. Complete with the same crispy fried chicken shell and fillings, the wilder version is topped off with a bold, smoky Wild sauce that is bound to warm up taste buds.\""
  },
  {
    "name": "XXL Chalupa",
    "url": "https://tacobell.fandom.com/wiki/XXL_Chalupa",
    "img": "Taco-bell-xxl-chalupa.jpg",
    "detail": "The XXL Chalupa was a specialty menu item available at Taco Bell from summer 2010 until 2011. It came with a $2.99 price tag for the default beef version.\n\nThe XXL Chalupa was 57.5% larger than the original Chalupa, by mass, and carried a double-sized Chalupa shell packed with seasoned ground beef, crispy lettuce, tomatoes, real cheddar cheese and nacho cheese sauce, red strips and topped with reduced fat sour cream."
  },
  {
    "name": "Chicken",
    "url": "https://tacobell.fandom.com/wiki/Chicken",
    "img": "Roast_chicken.jpg",
    "detail": "Chicken is one of Earth's most common and widespread domestic animals and its meat can be found in a variety of Taco Bell products.\n\nTaco Bell primarily uses two different types of chicken in its products:\n\nChicken can be found in a wide variety of Taco Bell menu items, including:\n\nChicken can be obtained as an upgrade from ground beef in several items, including:\n\nChicken has been used in a number of limited-run promotional items over the years, including:"
  },
  {
    "name": "Crunchy Red Strips",
    "url": "https://tacobell.fandom.com/wiki/Crunchy_Red_Strips",
    "img": "Img_2944.jpg",
    "detail": "Google.com\nCrunchy Red Strips are a type of red-colored tortilla chip appearing in numerous Taco Bell menu items, including the Big Taste Taco, Zesty Chicken Border Bowl, double steak triple cheese burrito, and the Fully Loaded Nachos. Crunchy Red Strips also appeared in the Nacho Crunch Grilled Stuft Burrito, which was available in late 2006 in select Taco Bell restaurants.\n\nCrunchy Red Strips, as seen in the Big Taste Taco\nCrunchy Red Strips debuted in June 2003 in the limited-time promotional Caesar Grilled Stuft Burrito. When the promotion ended the following August, the Crunchy Red Strips were thought to be lost forever until they resurfaced in the Zesty Chicken Border Bowl in November 2004.\n\nDebate rages over whether the Crunchy Red Strips are made of the same red  tortilla stock used to produce the Volcano Taco.\n\nThey left the menu on March 11, 2021, with the re-release of the Quesalupa and the return of potatoes. They returned on July 22, 2021 with the release of Loaded Taco Fries.\n\nStarting December 26, 2021, these were replaced with tri-color Fiesta Strips which adds orange and purple to the already red strips."
  },
  {
    "name": "Ground beef",
    "url": "https://tacobell.fandom.com/wiki/Ground_beef",
    "img": "Tacos21.gif",
    "detail": "Ground beef, as seen in a crunchy Taco Supreme and a Crunchy Taco\nGround beef is a product made of the meat of a cow that has been finely chopped by a meat grinder and is commonly found in a variety of Taco Bell menu items. Taco Bell's ground beef is salty and spicy to taste and is often complemented with shredded cheddar cheese, lettuce, sour cream, or other cool, neutralizing substances.\n\nGround beef is a versatile substance found in items from all corners of the Taco Bell menu, including:\n\nGround beef is feature in a number of limited-run items, including:"
  },
  {
    "name": "Category:Items containing chicken",
    "url": "https://tacobell.fandom.com/wiki/Category:Items_containing_chicken",
    "img": null,
    "detail": null
  },
  {
    "name": "Category:Items containing Crunchy Red Strips",
    "url": "https://tacobell.fandom.com/wiki/Category:Items_containing_Crunchy_Red_Strips",
    "img": null,
    "detail": null
  },
  {
    "name": "Lava Sauce",
    "url": "https://tacobell.fandom.com/wiki/Lava_Sauce",
    "img": "IMG_0084.jpg",
    "detail": "A ramekin of Lava Sauce\nLava Sauce in the Volcano Taco\nLava Sauce in the Volcano Nachos\nLava Sauce was a spicy nacho cheese sauce that added a fiery kick to Taco Bell's menu offerings for several years. It was first introduced in 2008 as part of the Volcano Taco, which quickly became a fan favorite thanks in part to the bold flavor of the Lava Sauce. Following the success of the Volcano Taco, Lava Sauce was also included in other popular menu items such as the Volcano Nachos and the Volcano Double Beef Burrito.\n\nFor several years, Lava Sauce remained a popular choice among Taco Bell customers who appreciated its unique combination of spice and cheese. However, the sauce was eventually discontinued in 2013, much to the disappointment of many fans. The reasons for the discontinuation of Lava Sauce are not entirely clear, but it is possible that the sauce's intense spiciness may have made it less appealing to some customers.\n\nDespite its discontinuation, Lava Sauce made a brief return to Taco Bell's menu in September 2015 as part of the Volcano Quesarito and Steak Burrito. The limited-time offering was a hit with fans, many of whom had been eagerly awaiting the return of the spicy nacho cheese sauce. While Lava Sauce may no longer be a regular menu item at Taco Bell, its legacy lives on among fans who continue to reminisce about the bold and flavorful sauce.\n\nLava sauce was temporarily brought back on June 29th 2023 (June 27th 2023 for Taco Bell Rewards Members) along with the Volcano Taco and the Volcano Double Beef Burrito.\n\nLava Sauce dates its origins back to June 1995, with its introduction in the Volcano Taco as a Congo tie in. Users across the country praised its roll-out, design, and flavor. In May 2009, the Volcano Menu expanded to include the Volcano Burrito and the Volcano Nachos, which incorporated Lava sauce and generated even more praise for the company.\n\nLava Sauce was a strong selling point for the Volcano Menu, and with the passage of time came a decrease in sales. Among the reasons was a leaning-away from fast food in general.\n\nAfter 5 years of stardom, much to the disappointment of many Taco Bell enthusiasts, Lava Sauce came to an end in September 2013. Several social media campaigns to bring it back were launched soon after the decision was made.\n\nOn September 23, 2015, Taco Bell announced the return of Lava Sauce in a tweet, which read:\n\nYou asked for it. Lava Sauce is back. Get it on the volcano taco tomorrow!\nThe spicy nacho cheese sauce had been a popular item in previous years and many fans had been asking for its return. To the delight of fans, Lava Sauce was brought back and was immediately available on the Volcano Taco.\n\nIn addition to the Volcano Taco, customers were able to add Lava Sauce to any menu item they desired. The sauce was made available in small plastic trays, making it easy for customers to dip their favorite Taco Bell items in the bold and flavorful sauce.\n\nThe return of Lava Sauce was met with great enthusiasm from fans, many of whom had been eagerly anticipating its comeback. Some fans even took to social media to share their excitement about the sauce's return and to express their appreciation for Taco Bell's decision to bring it back.\n\nWhile Lava Sauce is no longer a regular menu item at Taco Bell, the excitement generated by its brief return in 2015 is a testament to the sauce's enduring popularity among fans.\n\nOn March 16th, 2023, Taco Bell announced that they would be bringing back their popular Volcano Menu, complete with the fan-favorite Lava Sauce. The original Volcano Menu, launched in 2008, included items like the Volcano Taco, Volcano Burrito, and Volcano Nachos, all of which were known for their spicy flavors and Lava Sauce, a blend of cheese, sour cream, and fiery jalapenos. \n\n\nIt is worth noting that Lava Sauce has made an appearance in some form in Taco Bell's international markets. In the United Kingdom, for example, Taco Bell offers a tomato-based sauce that is also known as Lava Sauce. This sauce has a similar consistency and spiciness to the original Lava Sauce, but is more akin to a salsa in terms of flavor and texture. While this may not be the same Lava Sauce that fans remember from the past, it does offer a taste of the spicy sauce that many fans have been missing."
  },
  {
    "name": "Lettuce",
    "url": "https://tacobell.fandom.com/wiki/Lettuce",
    "img": "Double_Decker_Taco.png",
    "detail": "Lettuce, as seen in a Double Decker Taco\nA Taco Bell employee assembling a taco, with lettuce.\nLettuce is a leafy green vegetable that is a common ingredient in many Taco Bell items, providing both texture and volume to the dish. In most Taco Bell locations, the specific type of lettuce used is shredded iceberg lettuce, which is known for its mild taste and crisp texture.\n\nDespite being a low-calorie and low-fat ingredient, lettuce is still a good source of fiber, vitamins, and minerals. However, it has a relatively low nutritional density compared to other vegetables and is often used more as a filler or garnish than as a primary source of nutrients.\n\nBecause of its low calorie and high fiber content, lettuce is considered one of the healthiest items served at Taco Bell. It can help fill you up without adding too many calories to your meal, making it a great option for those looking to maintain a healthy diet while enjoying fast food.\n\nTaco Bell once featured two different types of lettuce in its menu items: romaine lettuce and iceberg lettuce. Romaine lettuce, with its darker color and more pronounced flavor, was a popular option for those looking for a slightly more robust taste in their dishes. \n\nHowever, in an effort to streamline its menu and focus on its most popular items, Taco Bell made the decision to indefinitely remove romaine lettuce from its offerings. This decision was likely driven by a desire to simplify operations and reduce waste by limiting the number of ingredients used in its dishes.\n\nDespite the removal of romaine lettuce, Taco Bell still offers its customers the same crisp and crunchy texture of iceberg lettuce, which is a staple in many of its menu items. While the absence of romaine lettuce may be disappointing for some, Taco Bell's continued commitment to providing fresh and tasty ingredients ensures that there are still plenty of delicious options to choose from."
  },
  {
    "name": "Pico De Gallo",
    "url": "https://tacobell.fandom.com/wiki/Pico_De_Gallo",
    "img": "Spicy-chicken-Taco.jpg",
    "detail": "Pico De Gallo, as seen in a Fresco Spicy Chicken Soft Taco\nPico De Gallo is a mixture of diced tomatoes, white onions and cilantro that was found in numerous items at Taco Bell. Items found on Taco Bell's Fresco Menu had their cheese and/or sour cream and sauce replaced with Pico De Gallo.\n\nPico De Gallo was discontinued in 2020 and replaced with diced tomatoes when ordering items Fresco style.\n\nA single portion of Pico De Gallo contains 5 calories and no fat.\n\nItems that feature Pico De Gallo other than those featured on the Fresco Menu include:\n\nSpicy Chicken has been discontinued at all locations. The Ultimate Chalupa was only a limited time only offer and is no longer on the menu."
  },
  {
    "name": "Potato",
    "url": "https://tacobell.fandom.com/wiki/Potato",
    "img": "Potato.jpg",
    "detail": "It's a potato. What else do you expect, good sir?\nIt is a potato. During the COVID-19 pandemic, Taco Bell announced the removal of potatoes from the menu. This followed a trend of several fast food restaurants simplifying their menu during the pandemic. However in early 2021, Taco Bell returned the potato in the form of two products, the Spicy Potato Soft Taco and Fiesta Potatoes, while promising to expand the menu with more vegetarian products in the future. "
  },
  {
    "name": "Shredded Chicken",
    "url": "https://tacobell.fandom.com/wiki/Shredded_Chicken",
    "img": "Spicy-chicken.jpg",
    "detail": "Shredded Chicken, as seen in a Spicy Chicken Burrito\nShredded Chicken is one of two styles of chicken typically served at Taco Bell restaurants, with the other being Grilled, Marinated All-White Meat Chicken. Shredded chicken is pulled from the bone, shredded and slow simmered in authentic Mexican spices. It is salty and spicy to taste, with more than a hint of cayenne pepper.\n\nOrder options and items using Shredded Chicken have been removed from the Taco Bell menu as of November 2020.[1]\n\nShredded chicken is found in a number of Taco Bell menu items, and is the chicken most likely to be found in items with \"Spicy Chicken\" in the name, including but not limited to:"
  },
  {
    "name": "Sour cream",
    "url": "https://tacobell.fandom.com/wiki/Sour_cream",
    "img": "ING-sour-cream-2_sql.jpg",
    "detail": "Sour cream is a prominent component in numerous Taco Bell menu items."
  },
  {
    "name": "Tomato",
    "url": "https://tacobell.fandom.com/wiki/Tomato",
    "img": "Tomato2.png",
    "detail": "Tomatoes are an herbaceous, usually sprawling plant in the Solanaceae family, found in an array of Taco Bell menu items. It is a perennial plant, often grown outdoors in temperate climates, and possesses a cool, neutral taste. Tomatoes are usually served diced and coupled with sour cream in Taco Bell menu items.\n\nKingdom: Taco\nOrder: Sandwich\n\nFamily: Beef\nGenus: Bell\nSpecies: Bell. B. Beefer\n\nTomatoes can be added to most items, either alone or as part of a Supreme upgrade, in which tomatoes are coupled with sour cream. Diced tomatoes are also the primary ingredient in Fiesta Salsa, which is found in many menu items as well as everything on the Fresco Menu.\n\nSee Fresco Menu\nSee Fiesta Salsa"
  },
  {
    "name": "Baja Blast Gelato",
    "url": "https://tacobell.fandom.com/wiki/Baja_Blast_Gelato",
    "img": null,
    "detail": "Coming soon"
  },
  {
    "name": "Caramel Apple Empanada",
    "url": "https://tacobell.fandom.com/wiki/Caramel_Apple_Empanada",
    "img": "Caramel_apple_empanada.jpg",
    "detail": "The Caramel Apple Empanada is a menu item available on Taco Bell's \"Dollar Cravings\" menu.\n\nIt consists of a crispy golden pastry pocket filled with chunks of warm apples in creamy caramel sauce, and is available for $1 at participating restaurants.\n\nThis menu item has been discontinued as of 2019."
  },
  {
    "name": "Cinnabon Delights",
    "url": "https://tacobell.fandom.com/wiki/Cinnabon_Delights",
    "img": null,
    "detail": "Cinnabon Delights are a dessert and a breakfast item served at Taco Bell. They are round pieces of bread covered with sugar and have an icing center. They come in a 2-pack, a 4-pack and a 12-pack.  They were first introduced in 2013."
  },
  {
    "name": "Cinnamon Twists",
    "url": "https://tacobell.fandom.com/wiki/Cinnamon_Twists",
    "img": "Twists.png",
    "detail": "Cinnamon Twists are crispy puffed corn twists sprinkled with cinnamon and sugar, similar to churros, and one of the few dessert items available at Taco Bell. They can be found in numerous places around the Taco Bell menu, including the 9¢ section of the Why Pay More!? Value Menu and in the Big Bell Box Meal. This website does not include the ingredients.\n\nCinnamon Twists were introduced circa 1988, replacing Cinnamon Crispas, which had been on the menu since 1980 and were made with fried flour tortilla wedges instead of corn twists.\n\nCinnamon Twists contain 170 calories, including 6 grams of fat and 1 gram of protein."
  },
  {
    "name": "Strawberry Bell Truffles",
    "url": "https://tacobell.fandom.com/wiki/Strawberry_Bell_Truffles",
    "img": "Strawberry_Bell_Truffles.jpg",
    "detail": "\n\n\nNotes: The official ingredients list for this item is unknown, the text below has been copied from Taco Bell's Newsroom\n\n\"The perfect slice of cake morphed into a convenient bite, the Strawberry Bell Truffle’s vanilla cake is studded with strawberry pieces and soaked in strawberry milk. The cake is then filled with a sweet corn fudge center. The outside is coated with a sweet and slightly salty strawberry and sweet corn cake coating, studded with tiny pieces of Taco Bell’s Crunchy Taco Shell. The unique coating adds an unexpected burst of flavor and satisfying texture for a one-of-a-kind eating experience.\"\n\nSummary: The Strawberry Bell Truffle is a strawberry Milk Bar truffle with corn elements including a corn cake coating and corn fudge filling."
  },
  {
    "name": "Quesadillas",
    "url": "https://tacobell.fandom.com/wiki/Quesadillas",
    "img": "DSCN2570.jpg",
    "detail": "A Chicken Quesadilla in its distinctive wrapper, seen with a soda\nQuesadilla is a popular Taco Bell dish in which a large flour tortilla has been stuffed with cheese, Creamy Jalapeño Sauce, and either chicken or beef before being folded in half and cooked in a grill press. Chicken Quesadillas were introduced as a promotional item in 2001, but along with a steak version, were promoted to permanent menu items later that year.\n\nQuesadillas are cut into fourths and generally served in a distinctive wrapper with a clear plastic viewing window."
  },
  {
    "name": "Breakfast Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Breakfast_Quesadilla",
    "img": "Breakfast_Quesadilla.jpeg",
    "detail": "The Breakfast Quesadilla is a breakfast item available at Taco Bell.\n\nIt was first introduced January 28, 2017. In 2020, it was taken off the menu temporarily as well as all the other breakfast items as many Taco Bells had to streamline operations due to the COVID-19 pandemic. The breakfast menu did return to Taco Bell in late 2021; however the Breakfast Quesadilla was not reintroduced until some point in 2022.\n\nBuenos Dias. It’s how you say “Good Morning” in Spanish.\n\nUnfortunately some mornings don’t start off so good, do they? We’ve all been there. Your alarm doesn’t go off, you misplaced your phone, you missed the bus, etc. Whatever the case, your morning is not going well and it looks like you won’t have time for breakfast (again). Not good amigo, but don’t worry because Taco Bell® has your back and can’t wait to fill that void in your life. Behold the deliciously new Breakfast Quesadilla. It’s filled with the warm, pillowy eggs and melty cheese you crave, all served up in that Mexican inspired way that only the Bell can do. It’s simply good, or as some might say… “Bueno”.\""
  },
  {
    "name": "Cantina Double Steak Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Cantina_Double_Steak_Quesadilla",
    "img": "Cantina_double_steak.jpg",
    "detail": "Taco Bell's Cantina Double Steak Quesadillas were a variety of quesadillas served at Taco Bell for a limited time in the summer of 2013.\n\nCantina Double Steak Quesadillas consisted of a double portion of thick-cut, marinated steak with pepper jack cheese folded inside a large flour tortilla, which was then pressed and grilled. It was also served with a side of tortilla chips, sour cream, and Cantina salsa on the side.\n\nCantina Double Steak Quesadillas contained 960 calories, 45 grams of fat and 2070 milligrams of sodium."
  },
  {
    "name": "Cheesarito",
    "url": "https://tacobell.fandom.com/wiki/Cheesarito",
    "img": "Cheesaito.png",
    "detail": "The Cheesarito, also known as the Quesarito was a menu item at Taco Bell’s in the greater Cincinnati, Tristate area during the 1980s. They were designed to compete with Zantigo’s Chilitos.  When Taco Bell purchased Zantigos they maintained both the Chiliyo and the Quesarito on the menu.  Eventually the Quesarito was discontinued, but the Chilito was only recently eliminated from the menu.  Taco Bell  it was often made by special request as a 'secret menu' item for nearly 4 decades after its removal from the menu. It consisted of a flour tortilla, Mexican Pizza sauce, scallions and cheese. During the discontinuation of the Mexican Pizza in 2020 this long-time favorite was no longer able to be ordered even as a 'secret menu' item due to the lack of Mexican Pizza sauce, but a similar version has become available once more since the 2022 Mexican Pizza rerelease, though this time without scallions.  \n\nThe new version can be created by adding Mexican Pizza Sauce to the Cheesy Roll Up available on the Cravings Value Menu."
  },
  {
    "name": "Cheese Extreme Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Cheese_Extreme_Quesadilla",
    "img": "CED.png",
    "detail": "The Cheese Extreme Quesadilla, as seen in a 2002 advertisement.\nTaco Bell's Cheese Extreme Quesadilla was a menu item that ran throughout 2002, as a limited-edition promotion for the X-Games sporting event. It was a quesadilla loaded with mozzarella, cheddar and pepper jack cheeses, plus nacho cheese sauce on a grilled tortilla.\n\nFollowing the launch of chicken and steak quesadillas earlier in 2002, Taco Bell Corp. introduced a new Cheese Extreme Quesadilla. The \"Xtreme Deal\" promoted the Cheese Extreme Quesadilla and four collectible X-Games beverage cups. With the purchase of a Cheese Extreme Quesadilla Combo, customers got a Cheese Extreme Quesadilla, a crunchy taco, and a free X-Games collector cup for $2.99.[1]"
  },
  {
    "name": "Cheese Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Cheese_Quesadilla",
    "img": "Quesadilla-taco-bell.jpg",
    "detail": "Cheese Quesadillas are a variety of quesadilla served at Taco Bell. They first appeared in late 2002.\n\nCheese Quesadillas consist of their three-cheese blend and a Creamy Jalapeño Sauce all folded in a freshly grilled tortilla.\n\nCheese Quesadillas contain 470 calories, 24 grams of fat and 1000 milligrams of sodium."
  },
  {
    "name": "Chicken Quesadillas",
    "url": "https://tacobell.fandom.com/wiki/Chicken_Quesadillas",
    "img": "Quesadilla_dude04_400.jpg",
    "detail": "Chicken Quesadillas are a variety of quesadilla served at Taco Bell. They first appeared in winter of 2002 as a promotional item, but were soon joined by its brethren, Steak Quesadillas on the permanent menu.\n\nA relatively difficult dish, Chicken Quesadillas consist of marinated white-meat chicken, Taco Bell's distinctive three-cheese blend and Creamy Jalapeño Sauce on a 10.5 inch flour tortilla, which is cooked on a grill press.\n\nChicken Quesadillas contain 703 calories, 56 grams of fat and 453 grams of protein."
  },
  {
    "name": "Crispy Chicken Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Crispy_Chicken_Quesadilla",
    "img": "Crispy_Chicken_Quesadilla.jpeg",
    "detail": "Taco Bell's Crispy Chicken Quesadilla was a menu item available at Taco Bell."
  },
  {
    "name": "Double Steak Grande Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Double_Steak_Grande_Quesadilla",
    "img": "Doublesteakgrande.jpg",
    "detail": "Double Steak Grande Quesadilla were a variety of quesadilla served at Taco Bell for a limited time in 2009.\n\nDouble Steak Grande Quesadillas consist of a double portion of thick-cut, marinated steak with three-cheese blend folded inside a thicker flour tortilla, which is then pressed/grilled.\n\nDouble Steak Grande Quesadillas contained 900 calories, 47 grams of fat and 1710 milligrams of sodium."
  },
  {
    "name": "Extreme Cheese and Beef Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Extreme_Cheese_and_Beef_Quesadilla",
    "img": "ExtremeBeefandCheese.jpg",
    "detail": "Extreme Beef and Cheese Quesadilla were a variety of quesadillas served at Taco Bell for a limited time. They first appeared in June of 2007, and were advertised as costing $1.29 on the Big Bell Value menu.\n\nThe Extreme Cheese and Beef Quesadilla was filled with the cheddar, mozzarella, and pepper jack three-cheese blend, and is topped with nacho cheese sauce and seasoned ground beef.\n\nExtreme Beef and Cheese Quesadillas contained 520 calories, 28 grams of fat, 14 grams of saturated fat, 2 grams of trans fat, and 1,510 milligrams of sodium."
  },
  {
    "name": "Kalua Pork Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Kalua_Pork_Quesadilla",
    "img": "Tacobell_kp_ques_macprice.jpg",
    "detail": "Kalua Pork Quesadilla is a variation on Taco Bell's popular quesadilla in which the chicken or beef of the standard quesadilla has been replaced with Kalua Pork. It is currently available only at Hawaiian Taco Bell locations and has yet to appear on mainland menus.\n\nKalua Pork Quesadillas contained 470 calories, 24 grams of fat, 30 grams of carbohydrates, 34 grams of protein, and 1,600 milligrams of sodium.\n\n'Taco Bell Goes Hawaiian' from The Tasty Island"
  },
  {
    "name": "Monterey Chicken Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Monterey_Chicken_Quesadilla",
    "img": "MontereyChickenQuesadilla.jpg",
    "detail": "Taco Bell's Monterey Chicken Quesadilla was a menu item available at Taco Bell."
  },
  {
    "name": "Quesarito",
    "url": "https://tacobell.fandom.com/wiki/Quesarito",
    "img": "Taco7f_2_web.jpg",
    "detail": "The quesarito is a menu item available at Taco Bell. It has the key components of a quesadilla and burrito rolled into one, and has seasoned beef all up in them cheeks really deep and good, premium Latin rice, Chipotle sauce, reduced-fat sour cream, and then wrapped up in a grilled quesadilla loaded with melted cheeses and nacho cheese sauce.\n\nThe name 'quesarito' is a clever example of a lingusitic blending known as portmanteau as it combines \"quesadilla\" and \"burrito.\" It is because of this that in Spanish-speaking countries the quesarito is commonly known as the \"what burrito.\"\n\nThe idea of the quesarito is not an original of Taco Bell, as Chipotle restaurants designed it from their secret menu. This idea dates back to 2011. However, Taco Bell is credited with innovating their own style of the quesarito, and making the food go mainstream and national in 2014.\n\nIn August of 2020, Taco Bell pulled it from their in-store and drive-through menus, instead only being available for order through the website or mobile app.\n\nOn April 19, 2023, the burrito was removed from the menu entirely. \n\nSince the mainstream launch of the quesarito, Taco Bell has introduced several variants of the quesarito. These include:\n\nWelcome to the Taco Bell Wiki's sandbox!\nThis page exists so that you can practice editing or formatting (see Editing help) without changing any serious content.  Feel free to try wiki editing out here first.\nThere is a tutorial on the Central (coordinating) Wikia that will step you through more of the things you can do.  Wiki allow for rather complicated formatting.  It can look overwhelming when you begin, but don't let it worry you.  Just start with the basics... enter some text, and learn the other pieces as you go.  Your content contributions are welcome and important.  The wiki is a collaborative effort and others can help with formatting and other improvements.\nBest wishes!\n\nAs an alternative, customers may also swap the ground beef for steak, chicken, or beans."
  },
  {
    "name": "Sausage Flatbread Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Sausage_Flatbread_Quesadilla",
    "img": "Taco-Bell-Sausage-Flatbread-Quesadilla.jpg",
    "detail": "The Sausage Flatbread Quesadilla is a breakfast menu item available at Taco Bell.\n\nIt contains sausage packed inside a flatbread with scrambled eggs and lots of warm, melted cheese.\n\nAlongside many other breakfast items, the Sausage Flatbread Quesadilla is $1."
  },
  {
    "name": "Steak Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Steak_Quesadilla",
    "img": "Steak_quesadilla.png",
    "detail": "Steak Quesadillas are a variety of quesadilla served at Taco Bell. They first appeared in late 2002.\n\nSteak Quesadillas consist of marinated premium thick cut steak combined with their three-cheese blend and a Creamy Jalapeño Sauce all folded in a freshly grilled tortilla.\n\nSteak Quesadillas contain 520 calories, 28 grams of fat, and 1200 milligrams of sodium."
  },
  {
    "name": "Volcano Quesarito",
    "url": "https://tacobell.fandom.com/wiki/Volcano_Quesarito",
    "img": "Maxresdefault.jpg",
    "detail": "The Volcano Quesarito is a recent menu item, released alongside Lava Sauce on September 24, 2015. It is much like a standard Quesarito, with the addition of Lava sauce.\n\nThe Volcano Quesarito is available either standalone or as a Big Box meal, which includes a Volcano Quesarito, alongside a Doritos Locos Taco, a standard Crunchy Taco, and a large soft drink for $5.99 (where available)."
  },
  {
    "name": "Western Bacon Quesadilla",
    "url": "https://tacobell.fandom.com/wiki/Western_Bacon_Quesadilla",
    "img": "Western_Bacon_Quesadilla.jpg",
    "detail": "The Western Bacon Quesadilla was a menu item at Taco Bell."
  },
  {
    "name": "Baja Chicken Taco",
    "url": "https://tacobell.fandom.com/wiki/Baja_Chicken_Taco",
    "img": "Baja_Chicken_Taco.jpg",
    "detail": "The Baja Chicken Taco was a menu item at Taco Bell. It consisted of chicken, baja sauce, lettuce, three cheese blend, and fiesta salsa (pico)."
  },
  {
    "name": "Baja Taco",
    "url": "https://tacobell.fandom.com/wiki/Baja_Taco",
    "img": null,
    "detail": "The Baja Taco is a limited run taco. It consists of everything a normal taco has, but also has Baja Sauce and Fiesta Salsa."
  },
  {
    "name": "Big Beef Taco",
    "url": "https://tacobell.fandom.com/wiki/Big_Beef_Taco",
    "img": "Ht_taco_bell_kab_140429_16x9_992.jpg",
    "detail": "The Big Beef Taco is a taco with extra beef."
  },
  {
    "name": "Big Border Taco",
    "url": "https://tacobell.fandom.com/wiki/Big_Border_Taco",
    "img": "BBT.png",
    "detail": "The Big Border Taco, as seen in a 1996 advertisement.\nThe Big Border Taco was a short-lived limited-run promotional item that was available at many Taco Bell locations during 1996. Little is known about the Big Border Taco, but it was roughly 1.5 times as large as a normal Crunchy Taco and contained ground beef and Pepper Jack cheese.\n\nThe taco enjoyed strong sales from its inception in February 1996, until its limited-time promotion ended in late 1996."
  },
  {
    "name": "Big Taste Taco",
    "url": "https://tacobell.fandom.com/wiki/Big_Taste_Taco",
    "img": "Img0311.jpg",
    "detail": "The Big Taste Taco was a taco that debuted in May 2008 as one of several new items unveiled on the Why Pay More!? Value Menu. The Big Taste Taco was a soft taco containing ground beef, lettuce, cheese, crunchy Red Strips, and creamy jalapeño sauce and usually cost $.99 at most participating Taco Bells.\n\nThe Big Taste Taco was discontinued in June 2009, according the RGM Briefing for June 2009.\n\n\n\nAccording to the official Taco Bell website, the Big Taste Taco contained 420 calories and 14 gram of protein."
  },
  {
    "name": "Black Jack Taco",
    "url": "https://tacobell.fandom.com/wiki/Black_Jack_Taco",
    "img": "Black-Jack-Taco-from-Taco-Bell.jpg",
    "detail": "The Black Jack Taco was a limited edition, Halloween-themed taco, that consisted of a black taco shell filled with beef, Baja Sauce, lettuce and the three cheese blend. It premiered in 2009 and has not made a return since.\n\nThe Black Jack Taco made waves when it was discovered that it could turn consumer's stool green, similar to Burger King's Halloween Whopper in 2015, six years after this taco was released. The black dye is thought to be responsible for the color change.\n\nA Google search, c.2009, of the \"green poop\" issue."
  },
  {
    "name": "BLT Taco",
    "url": "https://tacobell.fandom.com/wiki/BLT_Taco",
    "img": "BLTtaco.png",
    "detail": "The BLT Taco was a limited run taco. Like the name suggests, this taco had bacon, lettuce and tomato, along with club sauce and cheddar cheese. This taco was part of Taco Bell's \"Sizzlin' Bacon Menu\" in the 1990s and 2000s, and was promoted alongside the Bacon Cheeseburger Burrito and the Chicken Club Burrito."
  },
  {
    "name": "Cantina Crispy Melt Taco",
    "url": "https://tacobell.fandom.com/wiki/Cantina_Crispy_Melt_Taco",
    "img": "Cantina_crispy_melt_taco.jpg",
    "detail": "Cantina Crispy Melt Taco is a limited-time menu item at Taco Bell. Its contents are a base of nacho cheese and 3-cheese which is topped with sour cream, lettuce, cheese, and tomato. It is offered with beef or black bean as a protein. The main defining features of the taco are its white corn shell and melted cheese on the bottom.\n\nThe Cantina Crispy Melt Taco originally released in 2021 and was re-released again at the start of 2023."
  },
  {
    "name": "Cheesy Gordita Crunch",
    "url": "https://tacobell.fandom.com/wiki/Cheesy_Gordita_Crunch",
    "img": "TacoBell_CheesyGorditaCrunch.jpg",
    "detail": "The Cheesy Gordita Crunch is a hybrid taco introduced in 2004 offered at most Taco Bell locations. It is a standard crunchy taco wrapped in soft flatbread, held together by a layer of melted cheese. The item originally contained Baja Sauce but this has been substituted for Spicy Ranch ever since Baja Sauce was removed from the menu in 2014."
  },
  {
    "name": "Crunchy Border Tacos",
    "url": "https://tacobell.fandom.com/wiki/Crunchy_Border_Tacos",
    "img": "CrunchyBorderTacos.jpg",
    "detail": "The Crunchy Border Tacos is a menu item available at Taco Bell."
  },
  {
    "name": "Crunchy Taco",
    "url": "https://tacobell.fandom.com/wiki/Crunchy_Taco",
    "img": "CrunchyTaco.jpg",
    "detail": "Crunchy Tacos are tacos served at all Taco Bell locations that consist of a crispy corn tortilla shell stuffed with ground beef, lettuce, and shredded cheddar cheese.  They may also be available \"Supreme,\" meaning sour cream and diced tomatoes are added as well. Crunchy Tacos can be found on Taco Bell's Why Pay More? Value Menu, priced at 89¢.\n\nIn a series of Taco Bell TV commercials that aired during the 1990s, it was implied that Crunchy Tacos may be a major cause of Taco-Neck Syndrome."
  },
  {
    "name": "Doritos Locos Tacos",
    "url": "https://tacobell.fandom.com/wiki/Doritos_Locos_Tacos",
    "img": null,
    "detail": "Doritos Locos Tacos are a Taco Bell food item.  It was first released on October 14, 2012, in Nacho Cheese at a Taco Bell in Mankato, Minnesota.  A crunchy taco with ground beef, lettuce, and real cheddar cheese, in a shell made out of Doritos chips in Nacho Cheese, Cool Ranch, or Fiery.\n\nThe Cool Ranch version was released on March 7, 2013, and the Fiery version was released on August 22, 2013. Both were discontinued on September 12, 2019 due to low popularity, leaving only the Nacho Cheese version to stay on menus now.\n\nA Flamin' Hot Doritos Locos Taco was released on April 16, 2020, which featured a red shell with Flamin' Hot Doritos flavoring on it. It was brought back on July 22, 2021 as part of a giveaway thanks to the Milwaukee Bucks' comeback.\n\nA Flamin' Hot Cool Ranch Doritos Locos Taco was released on February 10, 2022, which sold out very quickly during the promotion period.\n\nThese tacos have special cases to hold them because of the flavoring dust on the taco shell.\n\nWhile all types of Doritos Locos Tacos are great, the most popular is the standard Nacho Cheese."
  },
  {
    "name": "Double Decker Taco",
    "url": "https://tacobell.fandom.com/wiki/Double_Decker_Taco",
    "img": "Double_Decker_Taco.png",
    "detail": "IThe Double Decker Taco is a hybrid taco once offered at most Taco Bell locations, consisting of a soft flour tortilla wrapped around a traditional crunchy taco with a layer of refried beans serving as a mortar between the two tortillas. After the advent of the Why Pay More! Value Menu, the double deck taco is no longer a sub-$1 item. Although the Why Pay More! Value Menu offers the taco as part of their $2 Meal Deals. In the United Kingdom there is an offer called the £4.99 Fill Up Box where it has a Double Decker Taco but Nacho Cheese Sauce replaces the Re-Fried Beans.\n\nCheesy Double Decker Taco\nThe Double Decker Taco was introduced as a limited-run promotional item in 1995 and was advertised in a series of commercials featuring NBA basketball stars Shaquille O'Neal and Hakeem Olajuwan, before becoming a permanent menu item. The Double Decker Taco joined the regular menu items in June 2006. It was discontinued from the menu on September 12, 2019. Yet, this item was brought back in December 2023 for a limited time.         "
  },
  {
    "name": "Fiesta Taco Salad",
    "url": "https://tacobell.fandom.com/wiki/Fiesta_Taco_Salad",
    "img": null,
    "detail": "The Fiesta Taco Salad, commonly referred to as simply the taco salad, was a menu item available at Taco Bell. It was a crisp taco salad shell filled with ground beef, refried beans, rice, crunchy red strips, lettuce, tomatoes, shredded cheese, and sour cream."
  },
  {
    "name": "Grande Soft Taco",
    "url": "https://tacobell.fandom.com/wiki/Grande_Soft_Taco",
    "img": "Grandesofttaco.jpg",
    "detail": "One of the only known photographs of Grande Soft Taco\nGrande Soft Taco is a modified Soft Taco in which the portion of ground beef has been doubled and the entire unit is wrapped in another soft flour tortilla, with nacho cheese serving as a mortar between the two shells.\n\nGrande Soft Taco can be found on the Big Bell Value Menu.\n\nGrande Soft Taco contains 450 calories, including 21 grams of fat and 19 grams of protein."
  },
  {
    "name": "Green Burrito",
    "url": "https://tacobell.fandom.com/wiki/Green_Burrito",
    "img": "1397248329000-photo-3-9-.JPG",
    "detail": "A Green Burrito, on top of a Taco Bell wrapper listed as \"Special\".\nThe Green Burrito is an item available from Taco Bell. It is a bean burrito with onions, cheese, and Verde sauce.\n\nThe green burrito is called a \"secret item\" because it is not on the menu, and must be asked for at the counter.  \n\nthe green sauce is the Green Tomatillo sauce,  not   the  verde sause in the packets \n\nThe green burrito is the best Taco Bell item ever.  Bring it back you FUCKS!!!"
  },
  {
    "name": "Grilled Steak Soft Taco",
    "url": "https://tacobell.fandom.com/wiki/Grilled_Steak_Soft_Taco",
    "img": "2950808_orig.jpg",
    "detail": "The Grilled Steak Soft Taco is a steak alternative to the Ranchero Chicken Soft Taco.\n\nOriginally, it featured a lime sauce with lettuce, cheddar cheese, and tomatoes. Now the taco features Avocado Ranch sauce, lettuce, cheddar cheese, and (contrary to the Ranchero Chicken Soft Taco's fiesta salsa) tomatoes.\n\n2023 - Steak soft tacos only come with, lettuce and cheese. Nothing else unless you pay extra/"
  },
  {
    "name": "Kid's Taco",
    "url": "https://tacobell.fandom.com/wiki/Kid%27s_Taco",
    "img": "O.jpg",
    "detail": "A Crunchy Taco with no lettuce, often how the Kid's Taco would appear.\nThe Kid's Taco is a taco that used to be a part of the Taco Bell Kid's Meal . This taco was very similar to a normal taco, but there is no lettuce and there are two types of cheeses inside: Monterey Jack and cheddar."
  },
  {
    "name": "Nacho Cheese Dorotos Locos Tacos",
    "url": "https://tacobell.fandom.com/wiki/Nacho_Cheese_Dorotos_Locos_Tacos",
    "img": null,
    "detail": 13
  },
  {
    "name": "Naked Egg Taco",
    "url": "https://tacobell.fandom.com/wiki/Naked_Egg_Taco",
    "img": "Naked_Egg_Taco.jpeg",
    "detail": "The Naked Egg Taco is a breakfast item available at Taco Bell. It is also part of the Naked Egg Taco Combo.\n\n\"What is the shell? Seriously…what the shell is the shell? No, you’re not dreaming. It’s the new Naked Egg Taco, so you can only imagine what the shell the shell is?\n\nConfused by all the shell talk yet? Nah, you know what we’re talking about. The shell of a Naked Egg Taco is a fried egg, of course! And it’s our first taco made entirely of classic breakfast ingredients, both inside and out. It’s what you’ve always dreamed the perfect breakfast could be. Kind of like the breakfast you remember mom making you every morning. You know, with the smiley face bacon and all. Ok, we can’t guarantee there will be a smiley face made out of bacon inside your taco, but one bite is sure to put a smile on your face. It’s got your choice of bacon or sausage, seasoned potatoes, and warm melty cheddar cheese and nacho cheese sauce all folded up in a fried egg. You guessed it, in the shape of taco because, well, we ARE Taco Bell after all.\n\nLike we said, this taco is what you’ve always dreamed of. Let’s call it…the breakfast of your dreams! And this breakfast of your dreams is literally in your dreams. You’ll be dreaming about this Naked Egg Taco every night. You may even catch yourself day dreaming about it while you’re at work. We don’t blame you. We find ourselves dreaming about this dreamy breakfast taco too, which is why we created it. Now everyone can get a taste of this delicious breafasty dream. But that doesn’t mean you have to stop dreaming. We don’t want you to give up dreaming altogether, because where’s the fun in that? Just know that the Naked Egg Taco is real life now. So go ahead… Roll into your local Taco Bell and see for yourself. Your dream HAS come true with the Naked Egg Taco.\""
  },
  {
    "name": "Ranchero Chicken Soft Taco",
    "url": "https://tacobell.fandom.com/wiki/Ranchero_Chicken_Soft_Taco",
    "img": "Pdp_rancho_taco.jpg",
    "detail": "The Ranchero Chicken Soft Taco was a taco which featured chicken, lettuce, cheddar cheese, Fiesta Salsa, and the (new at the time) Avocado Ranch Sauce in a soft, flour tortilla. It was available from 2004 until 2010."
  },
  {
    "name": "Soft Taco",
    "url": "https://tacobell.fandom.com/wiki/Soft_Taco",
    "img": "799px-TacoBellSoftTaco.jpg",
    "detail": "A soft taco\nSoft tacos are tacos that consist of a soft flour tortilla stuffed with ground beef, lettuce and shredded cheddar cheese. They are available at all Taco Bell locations, and in May 2008 they were placed on the Why Pay More!? Value Menu in the 99¢ section.\n\nWhy Pay More? Value Menu on TacoBell.com"
  },
  {
    "name": "Soft Taco Supreme",
    "url": "https://tacobell.fandom.com/wiki/Soft_Taco_Supreme",
    "img": null,
    "detail": "Taco Bell's Taco Tales \"Brain Freeze\" (Episode 5)\nDepiction of a human being after ingesting the Soft Taco Supreme.\nTaco Bell's Soft Taco Supreme is a previous menu item now unavailable at  all restaurant locations. Instead of a tough corn shell, the Soft Taco Supreme had a warm, flour tortilla, with all the ingredients of a Crunchy Taco Supreme, which is also no longer available.\n\nOne Soft Taco Supreme contains approximately 3,450 calories, 102g of protein, 47g of carbs, and 531g of fat.[1]\n\nIn 2016, the FDA concluded that the Soft Taco Supreme was too toxic for human consumption, and saw it fit to be removed from the menu a few weeks after this statement. Nausea, vomiting, diarrhea, dizziness, headache, internal bleeding, and fatigue have all been known to be caused by the Soft Taco Supreme, according to the FDA.\n\n2. https://www.tacobell.com/nutrition/info"
  },
  {
    "name": "Spicy Chicken Soft Taco",
    "url": "https://tacobell.fandom.com/wiki/Spicy_Chicken_Soft_Taco",
    "img": "Spicy-chicken-Taco.jpg",
    "detail": "The Spicy Chicken Soft Taco is a variation on Taco Bell's traditional soft taco, which features spicy shredded chicken, lettuce, and Fiesta Salsa wrapped in a soft burrito. The chicken found in the Spicy Chicken Soft Taco is the same as that of the Spicy Chicken Burrito.\n\nAccording to various sources, the Spicy Chicken Soft Taco began on the now-defunct Big Bell Value Menu, and after the removal of the menu, the taco became a regular addition to the lineup.\n\nCalorieCount.com gives this taco a D+ rating. It has 160 calories, 5g of fat, and 480mg of sodium."
  },
  {
    "name": "Sriracha Taco",
    "url": "https://tacobell.fandom.com/wiki/Sriracha_Taco",
    "img": null,
    "detail": "Sriracha Taco was a menu item at Taco Bell."
  },
  {
    "name": "Taco",
    "url": "https://tacobell.fandom.com/wiki/Taco",
    "img": "CrunchyTaco.jpg",
    "detail": "The taco is the titular culinary unit available at Taco Bell. It consists of a corn or flour tortilla generally stuffed with ground beef and lettuce.\n\nTaco Bell began selling tacos upon the opening of the first Taco Bell restaurant, in 1976. The only taco available was the crunchy taco, and it quickly became a staple of the restaurant. As the number of Taco Bell restaurants expanded, so did demand for a new design. In 1970, the soft taco was released, and became the best-selling menu item of any fast food restaurant for all of 1970 and 1971.\n\nThe taco has since undergone many changes and upgrades, from the Taco Lite of the 1980s, to the Doritos Locos Tacos of today. Tacos are available in many different varieties, including chicken, steak, and beef. Tacos can also have different toppings, including sour cream, lettuce, cheese, tomatoes, rice, and pico de gallo.\n\nVariations on the standard crunchy and soft tacos are abundant, including:"
  },
  {
    "name": "Taco Bell Grande",
    "url": "https://tacobell.fandom.com/wiki/Taco_Bell_Grande",
    "img": null,
    "detail": "The Taco Bell Grande is a limited run taco which fundamentally was a larger sized Taco Supreme topped with sliced black olives."
  },
  {
    "name": "Taco Light",
    "url": "https://tacobell.fandom.com/wiki/Taco_Light",
    "img": "Taco_Lite.png",
    "detail": "The Taco Light, as seen in an undated commercial.\nThe Taco Lite  (also known as the Tacos for broke people) was a menu item at Taco Bell restaurants during the 1980's. The taco consisted of an extra long white flour tortilla shell filled with double the meat (when compared to normal tacos), along with lettuce, tomatoes, sour cream and cheddar cheese.\n\nThe shell was the same kind of shell still used as the bowl for the Taco Salad (light and flaky). The shell, when bitten into, would never splinter down the taco, or cause the entire shell to fail as a normal shell will sometimes do. Instead it would leave an outline of exactly where the bite took place.\n\nIt was on the menu for quite a few years. The running theory as to why the item was discontinued is in the name \"light\". The majority of customers saw this menu item as some sort of \"diet taco\", when in reality, it was very high in calories, due in part to its large size. Customers did not go to Taco Bell to eat a diet taco, so sales were poor.\n\nCurrent Status\n\nSeveral social media outlets have groups requesting the return of the Taco Light. Official word has been given as of October 2020."
  },
  {
    "name": "Taco Supreme",
    "url": "https://tacobell.fandom.com/wiki/Taco_Supreme",
    "img": "Taco-supreme-2_sm.JPG",
    "detail": "The Taco Supreme is an upgrade to the standard-issue taco, in which the supreme treatment has been applied. They are available at all Taco Bell locations and can be ordered with either crunchy or soft shells. You could get it supreme, which added tomato and sour cream.\n\nThe crunchy Taco Supreme contains 200 calories, 12 grams of fat, and 9 grams of protein. The soft variety contains 240 calories with 11 grams of fat and protein."
  },
  {
    "name": "Volcano Taco",
    "url": "https://tacobell.fandom.com/wiki/Volcano_Taco",
    "img": "Volcano_taco.png",
    "detail": "The Volcano Taco is a taco that was initially available in a limited-time release at select Taco Bell locations during the fall of 2008, but have since been added to the permanent menu. Volcano Tacos consist of a distinctive red crunchy taco shell stuffed with ground beef, lettuce, Lava Sauce, and a spicy nacho cheese sauce that was unavailable prior to the introduction of the Volcano Taco.\n\nVolcano Taco is unrelated to the Volcano Burrito, a limited-run promotional item available in 1995 as a tie-in with the film Congo, which was billed as \"the spiciest burrito ever.\"\n\nIn July 2009, the Volcano Taco had returned through 2013 until Taco Bell decided to discontinue this menu item.  \n\nIn March of 2023, Taco Bell announced the return of the Volcano Taco. June 27th 2023 the Volcano Taco was available early for Taco Bell rewards members and made available to the general public on June 29th 2023.   \n\nOne of the most prominent design features of the Volcano Taco is its red crunchy taco shell. To date, it is the only Taco Bell product to utilize an alternative-colored taco shell, other than the Black Jack Taco (featuring a black shell) and the Doritos Locos Taco (featuring an orange Dorito-colored shell). Speculation has raged over whether the Crunchy Red Strips found in items such as the Big Taste Taco originate from the same red-tortilla source material as the Volcano Taco shell.\n\nThe Volcano Taco has been billed in Taco Bell commercials as possibly \"The spiciest taco ever.\" The Volcano Taco has also been included in an incarnation of the Big Bell Box Meal, as well as the Why Pay More!? Value Menu."
  },
  {
    "name": "XXL Steak Crispy Taco",
    "url": "https://tacobell.fandom.com/wiki/XXL_Steak_Crispy_Taco",
    "img": "TacoBell_XXLSteakCrispyTaco.jpg",
    "detail": "The XXL Steak Crispy Taco was a menu item at Taco Bell."
  },
  {
    "name": "Lettuce",
    "url": "https://tacobell.fandom.com/wiki/Lettuce",
    "img": "Double_Decker_Taco.png",
    "detail": "Lettuce, as seen in a Double Decker Taco\nA Taco Bell employee assembling a taco, with lettuce.\nLettuce is a leafy green vegetable that is a common ingredient in many Taco Bell items, providing both texture and volume to the dish. In most Taco Bell locations, the specific type of lettuce used is shredded iceberg lettuce, which is known for its mild taste and crisp texture.\n\nDespite being a low-calorie and low-fat ingredient, lettuce is still a good source of fiber, vitamins, and minerals. However, it has a relatively low nutritional density compared to other vegetables and is often used more as a filler or garnish than as a primary source of nutrients.\n\nBecause of its low calorie and high fiber content, lettuce is considered one of the healthiest items served at Taco Bell. It can help fill you up without adding too many calories to your meal, making it a great option for those looking to maintain a healthy diet while enjoying fast food.\n\nTaco Bell once featured two different types of lettuce in its menu items: romaine lettuce and iceberg lettuce. Romaine lettuce, with its darker color and more pronounced flavor, was a popular option for those looking for a slightly more robust taste in their dishes. \n\nHowever, in an effort to streamline its menu and focus on its most popular items, Taco Bell made the decision to indefinitely remove romaine lettuce from its offerings. This decision was likely driven by a desire to simplify operations and reduce waste by limiting the number of ingredients used in its dishes.\n\nDespite the removal of romaine lettuce, Taco Bell still offers its customers the same crisp and crunchy texture of iceberg lettuce, which is a staple in many of its menu items. While the absence of romaine lettuce may be disappointing for some, Taco Bell's continued commitment to providing fresh and tasty ingredients ensures that there are still plenty of delicious options to choose from."
  },
  {
    "name": "Pico De Gallo",
    "url": "https://tacobell.fandom.com/wiki/Pico_De_Gallo",
    "img": "Spicy-chicken-Taco.jpg",
    "detail": "Pico De Gallo, as seen in a Fresco Spicy Chicken Soft Taco\nPico De Gallo is a mixture of diced tomatoes, white onions and cilantro that was found in numerous items at Taco Bell. Items found on Taco Bell's Fresco Menu had their cheese and/or sour cream and sauce replaced with Pico De Gallo.\n\nPico De Gallo was discontinued in 2020 and replaced with diced tomatoes when ordering items Fresco style.\n\nA single portion of Pico De Gallo contains 5 calories and no fat.\n\nItems that feature Pico De Gallo other than those featured on the Fresco Menu include:\n\nSpicy Chicken has been discontinued at all locations. The Ultimate Chalupa was only a limited time only offer and is no longer on the menu."
  },
  {
    "name": "Potato",
    "url": "https://tacobell.fandom.com/wiki/Potato",
    "img": "Potato.jpg",
    "detail": "It's a potato. What else do you expect, good sir?\nIt is a potato. During the COVID-19 pandemic, Taco Bell announced the removal of potatoes from the menu. This followed a trend of several fast food restaurants simplifying their menu during the pandemic. However in early 2021, Taco Bell returned the potato in the form of two products, the Spicy Potato Soft Taco and Fiesta Potatoes, while promising to expand the menu with more vegetarian products in the future. "
  },
  {
    "name": "Romaine lettuce",
    "url": "https://tacobell.fandom.com/wiki/Romaine_lettuce",
    "img": "6000196832452.jpg",
    "detail": "Romaine lettuce is a different cultivar of lettuce from the standard iceberg lettuce used on most Taco Bell menu items. Romaine is generally only used on the Cantina items (Power bowl, etc.), but can be substituted/added to other items.\n\nIn 2018, the Centers for Disease Control (CDC) recalled romaine lettuce nationwide due to contamination with E. coli bacteria. This recall was later specified to only apply to lettuce grown in California. Because of this recall, romaine lettuce may not be available at many Taco Bell restaurants."
  },
  {
    "name": "Tomato",
    "url": "https://tacobell.fandom.com/wiki/Tomato",
    "img": "Tomato2.png",
    "detail": "Tomatoes are an herbaceous, usually sprawling plant in the Solanaceae family, found in an array of Taco Bell menu items. It is a perennial plant, often grown outdoors in temperate climates, and possesses a cool, neutral taste. Tomatoes are usually served diced and coupled with sour cream in Taco Bell menu items.\n\nKingdom: Taco\nOrder: Sandwich\n\nFamily: Beef\nGenus: Bell\nSpecies: Bell. B. Beefer\n\nTomatoes can be added to most items, either alone or as part of a Supreme upgrade, in which tomatoes are coupled with sour cream. Diced tomatoes are also the primary ingredient in Fiesta Salsa, which is found in many menu items as well as everything on the Fresco Menu.\n\nSee Fresco Menu\nSee Fiesta Salsa"
  }
]
